Pandas- Dataframe

In [2]:
import pandas as pd

what is a series 
A Series in pandas is a one-dimensional labeled array capable of holding any data type (integers, strings, floats, Python objects, etc.). Think of it as a column in a spreadsheet or a single column from a DataFrame.

In [4]:
data=[1,2,3,4,5,6]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

create a series from dictionary

In [5]:
data={'a':1,'b':2,'c':3}
series_data=pd.Series(data)
print(series_data)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30,40,50]
index=['a','b','c','d','e']
pd.Series(data,index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
##dataframe 
##create a dataframe from a dictionary of list 
data={
    'name':['Atharv','ram','Arya'],
    'Age':[21,25,36],
    'City':['Kolhapur','malkapur','hupari']

}
df=pd.DataFrame(data)
print(df)
print(type(df))

     name  Age      City
0  Atharv   21  Kolhapur
1     ram   25  malkapur
2    Arya   36    hupari
<class 'pandas.core.frame.DataFrame'>

In [9]:
import numpy as np 
np.array(df)

array([['Atharv', 21, 'Kolhapur'],
       ['ram', 25, 'malkapur'],
       ['Arya', 36, 'hupari']], dtype=object)

create a dataframe from list of Dictionary

In [15]:
data=[
    {'Name':'atharv','Age':21,'City':'Kolhapur'},
    {'Name':'Amrut','Age':23,'City':'maan'},
    {'Name':'Arya','Age':26,'City':'new york'},
    {'Name':'ram','Age':31,'City':'malkapur'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0  atharv   21  Kolhapur
1   Amrut   23      maan
2    Arya   26  new york
3     ram   31  malkapur
<class 'pandas.core.frame.DataFrame'>

##accesing data from dataframe

In [ ]:
df

     Name  Age      City
0  atharv   21  Kolhapur
1   Amrut   23      maan
2    Arya   26  new york
3     ram   31  malkapur

In [19]:
df['Name']
type(df['Name'])

pandas.core.series.Series

In [20]:
df.loc[0]

Name      atharv
Age           21
City    Kolhapur
Name: 0, dtype: object

In [22]:
df.iloc[0][0]

C:\Users\ATHARV\AppData\Local\Temp\ipykernel_15560\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'atharv'

Accessing a specified element

In [ ]:

df.at[3,'Age']
df.at[1,'Name']

'Amrut'

accessing a specified element using iat

In [30]:
df.iat[2,2]

'new york'

data Manipulation with dataframe

In [31]:
df

     Name  Age      City
0  atharv   21  Kolhapur
1   Amrut   23      maan
2    Arya   26  new york
3     ram   31  malkapur

In [45]:
##adding a new column 
df['salary']=[50000,60000,80000,90000]
df

     Name  Age      City  salary
0  atharv   21  Kolhapur   50000
1   Amrut   23      maan   60000
2    Arya   26  new york   80000
3     ram   31  malkapur   90000

In [43]:
# # removing a column 
# df.drop('salary',axis=1)##axis plays important role 
# #not a permanent operation

In [46]:
df

     Name  Age      City  salary
0  atharv   21  Kolhapur   50000
1   Amrut   23      maan   60000
2    Arya   26  new york   80000
3     ram   31  malkapur   90000

In [47]:
df.drop('salary',axis=1,inplace=True)
##for complete deletion

In [48]:
df

     Name  Age      City
0  atharv   21  Kolhapur
1   Amrut   23      maan
2    Arya   26  new york
3     ram   31  malkapur

In [49]:
##add age to column
df['Age']=df['Age']+1

In [50]:
df

     Name  Age      City
0  atharv   22  Kolhapur
1   Amrut   24      maan
2    Arya   27  new york
3     ram   32  malkapur

In [55]:
df=pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [57]:
#display data types of each column
print("Datatypes:\n",df.dtypes)


#describe data fame 
print("Statistical summary: \n",df.describe())

Datatypes:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000